//
//  Error.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "არასწორი მომხმარებელი ან პაროლი";
"_cancelled_by_user"                    = "ტრანსფერი უარყოფილია";
"_error_folder_destiny_is_the_same_"    = "დირექტორიის გადატანა საკუთარ თავში შეუძლებელია";
"_error_not_permission_"                = "ოპერაციის დასასრულებლად არ გაგაჩნიათ უფლებები";
"_error_path_"                          = "ამ ფაილის ან დირექტორიის გახსნა შეუძლებელია. დარწმუნდით რომ ის არსებობს";
"_file_upload_not_exitst_"              = "ფაილი რომლის ატვირთვაც გვინდა არ არსებობს";
"_forbidden_characters_from_server_"    = "სახელი მოიცავს დაუშვებელ სიმბოლოს";
"_not_connected_internet_"              = "სერვერთან კავშირის შეცდომა";
"_not_possible_connect_to_server_"      = "ამ მომენტისთვის სერვერთან დაკავშირება ვერ ხერხდება";
"_not_possible_create_folder_"          = "დირექტორია ვერ იქნმება";
"_server_down_"                         = "სერვერი მიუწვდომელია";
"_time_out_"                            = "დროის ამოწურვა, სცადეთ ახლიდან";
"_unknow_response_server_"              = "სერვერმა დააბრუნა მოულოდნელი პასუხი";
"_user_autentication_required_"         = "საჭიროა მომხმარებლის აუტენტიფიკაცია";
"_file_directory_locked_"               = "ფაილი ან დირექტორია ჩაკეტილია";
"_ssl_certificate_untrusted_"           = "ამ სერვერის სერტიფიკატი არასწორია";
"_internal_server_"                     = "შიდა სერვერის შეცდომა";

"_file_already_exists_"                 = "Unable to complete the operation, there is a file with the same name";
"_file_folder_not_exists_"              = "მოცემული მისამართით წყაროს ფაილი ვერ მოიძებნა";
"_folder_contents_nochanged_"           = "დირექტორიის მოცულობა არ შეცვლილა";
"_images_invalid_converted_"            = "სურათი არაა მართებული და ვერ კონვერტირდება მინიატურად";
"_method_not_expected_"                 = "მოთხოვნის მეთოდი არ იყო მოსალოდნელი";
"_reauthenticate_user_"                 = "წვდომას ვადა გაუვიდა, გთხოვთ ახლიდან გაატაროთ მომხმარებლის ავტორიზაცია";
"_server_error_retry_"                  = "სერვერი დროებით მიუწვდომელია";
"_too_many_files_"                      = "ამ ოპერაციის წარმატებით დასრულების შემთხვევაში, საქმე იქნებოდა ზედმეტად ბევრ ფაილთან";
"_too_many_request_"                    = "სიხშირის ლიმიტი—გაიგზავნა ზედმეტად ბევრი მოთხოვნა";
"_user_over_quota_"                     = "მიღწეულია საცავის კვოტის მაქსიმუმი";

"_ssl_connection_error_"                = "SSL კავშირის შეცდომა, სცადეთ ახლიდან";
